       FD  ERRORES.
       01  REG-ERRORES.
          05 DETALLE                    PIC X(98).
          05 CODIGO-ERROR               PIC X(8).
          05 DESCRIPCION-ERR            PIC X(40).
