       FD ENT-TARJETA.
       01 REG-MAESTRO.
          05 MAE-CUENTA                  PIC 9(10).
          05 MAE-NRO-TARJ                PIC X(19).
          05 MAE-APELLIDO                PIC X(20).
          05 MAE-NOMBRE                  PIC X(20).
          05 MAE-DIRECCION               PIC X(40).
          05 MAE-COD-POSTAL              PIC 9(4).
          05 MAE-MONEDA                  PIC X(3).
          05 MAE-LIMITE                  PIC 9(8)V99.
